import sys; sys.stdin = open("adv1_in.txt")
# N개의 문제 중 M개 맞추는데, 최소 점수 구하라

T = int(input())

for tc in range(1, T + 1):
    N, M, K = map(int, input().split())

    # 오답으로 나눌 수 있는 정답 구간의 개수
    groups = N - M + 1

    # 피할 수 없는 점수 2배 발생 횟수
    extra = max(0, M - groups * (K - 1))
    cnt = (extra + K - 1) // K

    # cnt번 점수가 2배가 된 뒤 남은 정답은 1점씩 추가
    score = 2 * K * (2 ** cnt - 1) + (M - cnt * K)

    print(f'#{tc} {score}')


"""
철수는 N개의 문제가 순차적으로 주어지는 면접에서 정확히 M개의 문제를 맞혔다. 어떤 문제를 맞혔는지는 기억나지 않지만, 정확히 M개를 맞혔다는 사실은 확실하다.
이 면접에서는 연속으로 문제를 맞힐 경우 점수를 더 많이 주는 카운터 시스템이 적용된다. 점수 계산 방식은 다음과 같다.
카운터의 초기값은 0이다.
문제를 틀릴 경우 카운터는 0으로 초기화된다.
문제를 맞힐 경우 1점을 획득한 후 카운터가 1 증가한다.
만약 카운터가 주어진 값 K에 도달하면, 카운터는 0으로 초기화되고 현재까지 획득한 총점이 2배가 된다.
철수가 M개의 문제를 맞힐 수 있는 모든 경우 중 최소 총점을 구하라.
아래 첫 번째 테스트 케이스에서 6번 문제를 틀리고, 나머지 문제를 다 맞히는 경우 최소 점수 10점을 얻는다. 문제가 진행되는 순서대로 총점 변화는 1점, 2점, 6점, 7점, 8점, 8점, 9점, 10점이다. 3번 문제를 맞혔을 때 1점을 획득하고 총점이 2배가 되면서 6점이 되었다는 것에 주의하라. 각 문제 별 상세 과정은 아래 표와 같다.

## 1번 문제 점수 계산 과정
| 번호 | 정답 여부 | 획득 점수 | 카운터 변화 | 총점 변화 | 비고 |
|---:|:---:|---:|---|---:|---|
| 1 | O | 1 | 0 → 1 | 0 → 1 | |
| 2 | O | 1 | 1 → 2 | 1 → 2 | |
| 3 | O | 1 | 2 → 3 → 0 | 2 → 3 → 6 | 카운터가 K에 도달하여 총점 2배 |
| 4 | O | 1 | 0 → 1 | 6 → 7 | |
| 5 | O | 1 | 1 → 2 | 7 → 8 | |
| 6 | X | 0 | 2 → 0 | 8 → 8 | 오답이므로 카운터 초기화 |
| 7 | O | 1 | 0 → 1 | 8 → 9 | |
| 8 | O | 1 | 1 → 2 | 9 → 10 | |
### 입력 조건
- 전체 문제 수: N = 8
- 맞힌 문제 수: M = 7
- 카운터 기준: K = 3
### 최종 결과
- 최소 총점: 10점

번호
정답 여부
획득 점수
카운터
총점
비고
1
O
1
1
1
2
O
1
2
2
3
O
1
3 → 0
3 → 6
카운터 K에 도달, 초기화
4
O
1
1
7
5
O
1
2
8
6
X
0
0
8
문제 틀림, 카운터 초기화
7
O
1
1
9
8
O
1
2
10
[제약사항]
1.     N은 3 이상 500 이하이다. (3 ≤ N ≤ 500)
2.     M은 1이상 N이하이다. (1 ≤ M ≤ N)
3.     K는 2 이상 N이하이다. (2 ≤ K ≤ N)
4.     풀이가 불가능한 경우는 주어지지 않는다.
5.     답은 32비트 int의 범위를 넘지 않음이 보장된다.
[입력]
가장 첫 줄에는 테스트 케이스의 총 수가 주어진다.
그 다음 줄부터 각 테스트 케이스가 주어지며, 각 테스트 케이스는 한 줄로 구성된다.
각 테스트 케이스의 첫 줄에는 N, M, K의 값이 공백을 사이에 두고 주어진다.
[출력]
출력의 각 줄은 ‘#x’로 시작하고, 공백을 한 칸 두고 문제에서 정의된 최소 점수를 출력한다. 단, x는 테스트 케이스의 번호이다.
[입력 예]
3                    // 테스트 케이스의 수
8 7 3               // N = 8, M = 7, K = 3, 테스트 케이스 #1
3 3 3               // N = 3, M = 3, K = 3, 테스트 케이스 #2
5 2 3               // N = 5, M = 2, K = 3, 테스트 케이스 #3
[출력 예]
#1 10
#2 6
#3 2
"""